#+OPTIONS: toc:nil

* Power digit sums

** Task

2^15 = 32768 and the sum of its digits is 3 + 2 + 7 + 6 + 8 = 26.

What is the sum of the digits of the number 2^1000?

** Solution

#+BEGIN_SRC python :results output :exports both
import math

print(sum([int(x) for x in str(int(math.pow(2, 1000)))]))
#+END_SRC

#+RESULTS:
: 1366
